{
  "home": {
    "text-1-p1": "Desenvolvedor Back-End ",
    "text-1-p2": "- Java / Spring Boot",
    "text-2-p1": "Sou um ",
    "text-2-p2": "profissional completo",
    "text-2-p3": ", além de back-end possuo conhecimentos em ",
    "text-2-p4": "Front-End ",
    "text-2-p5": "Redes ",
    "text-2-p6": "e ",
    "text-2-p7": "Devops",
    "text-3": "Conheça meus projetos "
  },
  "commons": {
    "home": "Início",
    "projects": "Projetos",
    "experience": "Experiência",
    "about": "Sobre"
  },
  "projects": {
    "repository-title": "Github do Projeto",
    "project-execution-title": "Site ou Documentação da API",
    "bot-notification-title":"Bot Notification Discord",
    "bot-notification-description":"Um bot que realiza webscraping em um site de light novels e realiza anuncios no discord de acordo com as novas publicações.",
    "uno-java-title": "Uno em Java com interface de terminal",
    "uno-java-description": "Um jogo de uno feito em java, com interface de terminal. O jogo possui todas as regras do uno original, além de permitir que o usuário jogue contra a máquina.",
    "medplus-title": "MedPlus",
    "medplus-description": "Um projeto de gerenciamento de consultas médicas. O usuário pode criar, editar e excluir consultas, além de visualizar as consultas já criadas.",
    "portifolio-v1-title": "Portifólio V1",
    "portifolio-v1-description": "Primeira versão do meu portifólio, feito com HTML, CSS, JS e React. O site possui uma página inicial, uma página de projetos, uma página de experiência e uma página sobre.",
    "portifolio-v2-title": "Portifólio V2",
    "portifolio-v2-description": "Segunda versão do meu portifólio, feito com NEXT, TS, Tailwind e Framer Motion.",
    "corona-vapo-title": "Corona Vapo",
    "corona-vapo-description": "Um jogo desenvolvido na Godot, voltado a concientização do distanciamento do covid-19, o jogador enfrenta diversas pessoas infectadas que são zumbis e recebe diversas mensagens referentes as medidas indicadas",
    "linear-system-title": "Calculadora de Sistemas Lineares",
    "linear-system-description": "Uma calculadora que resolve sistemas lineares de n variaveis, utilizando o método de Gauss. O usuário pode inserir as equações e o programa retorna a solução do sistema.",
    "party-manager-title": "Gerenciador de festas de aniversários",
    "party-manager-description": "Um projeto de gerenciamento de festas de aniversário. O usuário pode criar, editar e excluir festas, além de visualizar as festas já criadas."
  },
  "about":{
    "title": "Sobre:",
    "text-1": "Meu nome é Vinícius e sou apaixonado por tecnologia, musica, jogos e o universo geek como um todo, com certa frequência acabo pegando um jogo ou um anime para assistir, um dos meus hobbies é traduzir alguns destes do inglês para o português gratuítamente, para permitir que outros leitores também consigam apreciar essas obras.",
    "text-2": "Iníciei meus estudos na computação em meados de 2018, durante o primeiro ano do ensino médio, onde comecei a cursar o técnico de desenvolvimento de sistemas. Nessa época além das aulas do colégio, também comecei a acompanhar as aulas dos mestre Guanabara(canal no youtube Curso em Vídeo), já molhando a mão com python, html, css e js.",
    "text-3": "Durante os anos fui apreendendo várias coisas. Logo que terminei o ensino médio, iniciei minha carreira profissional como analista de suporte e simultaneamente começei na faculdade de ciências da computação. O trabalho me ajudou a fixar vários conhecimentos de redes que eu já possuia, além de me ajudar muito a melhorar minha comunicação, pois tinha que lidar com diversos clientes diariamente, e eu sempre tive uma certa timides.",
    "text-4": "Com o decorrer dos semestres trabalhando e estudando, comecei a procurar oportunidades para trabalhar na área de desenvolvimento e em 2023 inicei como desenvolvedor java junior, o que me ajudou a direcionar os meus estudos, e assim defini que seguiria no back-end com java e spring boot, nessa época já tinha um conhecimento geral sobre a área.",
    "text-5": "Atualmente estou no 7° semestre de ciências da computação na Universidade São Judas Tadeu, onde adquiri conhecimentos técnicos referente aos processos da computação e do desenvolvimento como um todo, lógica, estruturas de dados, bancos de dados, IA e modelos de linguagem, javascript, nodejs, angular, python e java.",
    "text-6": "E sigo estudando, iniciando novos projetos, as vezes dando continuidade em antigos, sempre evitando ficar estagnado."
  },
  "theme":{
    "light": "Claro",
    "dark": "Escuro",
    "system": "Sistema"
  },
  "experience":{
    "certification": "Certificação",
    "job": "Trabalho",
    "university": "Faculdade",
    "course": "Curso",
    "current": "Trabalho Atual",
    "university-1-title": "Bacharelado em Ciências da Computação",
    "university-1-subtitle": "Universidade São Judas Tadeu - 2020 - 2024",
    "university-1-description": "Bacharelado em Ciências da Computação, onde estudei a computação como um todo, programação com java, node, angular, python, estruturas de dados, lógica, IA, modelos de linguagem, redes, banco de dados, entre outros.",
    "job-1-title": "Desenvolvedor Java Jr",
    "job-1-subtitle": "JGM Empresarial - Maio 2023 - Atual",
    "job-1-description": "Desenvolvimento de novas aplicações Java. Manutenção e suporte a aplicações existentes, geralmente uso de bancos de dado SQL, desenvolvimento de interfaces com SWING, automações web e Web Scraping com Selenium, entre outras atividades. Tenho de comunicação direta com os usuários finais, sempre tendo o foco em identificar e solucionar os problemas de acordo com a regra de negócio dos processos e necessidades dos usuários.",
    "job-2-title": "Analista de Suporte",
    "job-2-subtitle": "G-InfoWork TI - Set 2021 - Maio 2023",
    "job-2-description": "Atuei como um analista de suporte. Dentre algumas de minhas responsabilidades estavam, controle de Backups com Veeam, cobian e outros, gerenciamento de rede com Windows Server e suas ferramentas, Firewall e VPN com PFSENSE, implantação do sistema de monitoramento Zabbix, além de suporte técnico abrangente (N1 a N3) para clientes de diferentes setores e tamanhos.",
    "course-1-title": "Curso Desenvolvimento de Sistemas e TI",
    "course-1-subtitle": "Colégio Anchieta - 2018 - 2020",
    "course-1-description": "Aqui foi onde iniciei meus estudos na área de TI, onde tive contato com as primeiras linguagens de programação, como python, html, css e js, além de ter uma base de redes e sistemas operacionais."
  }
}
